In [1]:
import sqlite3
import seaborn as sns
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [2]:
print(5 and 10)

10

In [3]:
print(10 and 5)

5

In [6]:
2+3*2

8

In [7]:
("THOMAS".lower())

'thomas'

In [8]:
print(4%2)

0

In [12]:
result = np.int64(4/2)
print(result)

2

In [16]:
arr = np.array([1,2,3,4,5,6,7,8])

In [17]:
arr.dtype

dtype('int64')

In [18]:
np.average(arr)

4.5

In [20]:
np.absolute(arr)

array([1, 2, 3, 4, 5, 6, 7, 8])

In [22]:
print(round(2.51))

3

In [23]:
df = pd.read_csv("/Users/thomassimmons/Downloads/titanic.csv")

In [24]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [32]:
df['Age'].fillna(df['Age'].median(), inplace=True)

In [34]:
df['Age'] = df['Age'].astype('int64')

In [35]:
df['Age']

0      22
1      38
2      26
3      35
4      35
       ..
886    27
887    19
888    28
889    26
890    32
Name: Age, Length: 891, dtype: int64